rookiepeng/TI-CC3200-Exp/pinmux.c
//*****************************************************************************
// pinmux.c
//
// configure the device pins for different signals
//
// Copyright (c) 2016, Texas Instruments Incorporated - http://www.ti.com/
// All rights reserved.
//
//  Redistribution and use in source and binary forms, with or without
//  modification, are permitted provided that the following conditions
//  are met:
//
//    Redistributions of source code must retain the above copyright
//    notice, this list of conditions and the following disclaimer.
//
//    Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the
//    documentation and/or other materials provided with the
//    distribution.
//
//    Neither the name of Texas Instruments Incorporated nor the names of
//    its contributors may be used to endorse or promote products derived
//    from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

// This file was automatically generated on 5/9/2017 at 10:58:30 AM
// by TI PinMux version 4.0.1484
//
//*****************************************************************************

#include <hw_types.h>
#include <pin.h>
#include <prcm.h>
#include <rom_map.h>
#include <gpio.h>
#include <hw_gpio.h>
#include <hw_memmap.h>

#include "pinmux.h"

//*****************************************************************************
void PinMuxConfig(void)
{
        // Set unused pins to PIN_MODE_0 with the exception of JTAG pins 16,17,19,20
        //
        MAP_PinModeSet(PIN_03, PIN_MODE_0);
        MAP_PinModeSet(PIN_05, PIN_MODE_0);
        MAP_PinModeSet(PIN_06, PIN_MODE_0);
        MAP_PinModeSet(PIN_07, PIN_MODE_0);
        MAP_PinModeSet(PIN_08, PIN_MODE_0);
        MAP_PinModeSet(PIN_18, PIN_MODE_0);
        MAP_PinModeSet(PIN_21, PIN_MODE_0);
        MAP_PinModeSet(PIN_45, PIN_MODE_0);
        MAP_PinModeSet(PIN_50, PIN_MODE_0);
        MAP_PinModeSet(PIN_52, PIN_MODE_0);
        MAP_PinModeSet(PIN_53, PIN_MODE_0);
        MAP_PinModeSet(PIN_55, PIN_MODE_0);
        MAP_PinModeSet(PIN_61, PIN_MODE_0);
        MAP_PinModeSet(PIN_62, PIN_MODE_0);
        MAP_PinModeSet(PIN_63, PIN_MODE_0);

        //
        // Enable Peripheral Clocks
        //
        MAP_PRCMPeripheralClkEnable(PRCM_ADC, PRCM_RUN_MODE_CLK);
        MAP_PRCMPeripheralClkEnable(PRCM_GPIOA1, PRCM_RUN_MODE_CLK);
        MAP_PRCMPeripheralClkEnable(PRCM_GPIOA2, PRCM_RUN_MODE_CLK);

        //
        // Configure PIN_64 for GPIO Output
        //
        MAP_PinTypeGPIO(PIN_64, PIN_MODE_0, false);
        MAP_GPIODirModeSet(GPIOA1_BASE, 0x2, GPIO_DIR_MODE_OUT);

        //
        // Configure PIN_01 for GPIO Output
        //
        MAP_PinTypeGPIO(PIN_01, PIN_MODE_0, false);
        MAP_GPIODirModeSet(GPIOA1_BASE, 0x4, GPIO_DIR_MODE_OUT);

        //
        // Configure PIN_02 for GPIO Output
        //
        MAP_PinTypeGPIO(PIN_02, PIN_MODE_0, false);
        MAP_GPIODirModeSet(GPIOA1_BASE, 0x8, GPIO_DIR_MODE_OUT);

        //
        // Configure PIN_04 for GPIO Input
        //
        MAP_PinTypeGPIO(PIN_04, PIN_MODE_0, false);
        MAP_GPIODirModeSet(GPIOA1_BASE, 0x20, GPIO_DIR_MODE_IN);

        //
        // Configure PIN_15 for GPIO Input
        //
        MAP_PinTypeGPIO(PIN_15, PIN_MODE_0, false);
        MAP_GPIODirModeSet(GPIOA2_BASE, 0x40, GPIO_DIR_MODE_IN);
}
